---
kind: method
id: M:Autodesk.Revit.DB.ReferenceIntersector.SetFilter(Autodesk.Revit.DB.ElementFilter)
zh: 射线、射线相交
source: html/e94fc91b-34fb-f12b-ecd7-d9c30de9a7dd.htm
---
# Autodesk.Revit.DB.ReferenceIntersector.SetFilter Method

**中文**: 射线、射线相交

Sets the ElementFilter used in intersection testing.

## Syntax (C#)
```csharp
public void SetFilter(
	ElementFilter filter
)
```

## Parameters
- **filter** (`Autodesk.Revit.DB.ElementFilter`) - The ElementFilter. Pass Nothing nullptr a null reference ( Nothing in Visual Basic) to remove the existing filter.